#include <locale.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>

#define NUM_WORDS 257
#define NUM_ALPHABET 30

const char *words[NUM_WORDS] = {
"АЙТОС", "АКСАКОВО", "АЛФАТАР", "АНТОНОВО", "АПРИЛЦИ", "АРДИНО", "АСЕНОВГРАД",
	"АХЕЛОЙ", "АХТОПОЛ",
"БАЛЧИК", "БАНКЯ", "БАНСКО", "БАНЯ", "БАТАК", "БАТАНОВЦИ", "БЕЛЕНЕ", "БЕЛИЦА",
	"БЕЛОВО", "БЕЛОГРАДЧИК", "БЕЛОСЛАВ", "БЕРКОВИЦА", "БЛАГОЕВГРАД", "БОБОВ ДОЛ",
	"БОБОШЕВО", "БОЖУРИЩЕ", "БОЙЧИНОВЦИ", "БОЛЯРОВО", "БОРОВО", "БОТЕВГРАД",
	"БРАЦИГОВО", "БРЕГОВО", "БРЕЗНИК", "БРЕЗОВО", "БРУСАРЦИ", "БУРГАС", "БУХОВО",
	"БЪЛГАРОВО", "БЯЛА", "БЯЛА", "БЯЛА СЛАТИНА", "БЯЛА ЧЕРКВА",
"ВАРНА", "ВЕЛИКИ ПРЕСЛАВ", "ВЕЛИКО ТЪРНОВО", "ВЕЛИНГРАД", "ВЕТОВО", "ВЕТРЕН",
	"ВИДИН", "ВРАЦА", "ВЪЛЧЕДРЪМ", "ВЪЛЧИ ДОЛ", "ВЪРБИЦА", "ВЪРШЕЦ",
"ГАБРОВО", "ГЕНЕРАЛ ТОШЕВО", "ГЛАВИНИЦА", "ГЛОДЖЕВО", "ГОДЕЧ", "ГОРНА ОРЯХОВИЦА",
	"ГОЦЕ ДЕЛЧЕВ", "ГРАМАДА", "ГУЛЯНЦИ", "ГУРКОВО", "ГЪЛЪБОВО",
"ДВЕ МОГИЛИ", "ДЕБЕЛЕЦ", "ДЕВИН", "ДЕВНЯ", "ДЖЕБЕЛ", "ДИМИТРОВГРАД", "ДИМОВО",
	"ДОБРИНИЩЕ", "ДОБРИЧ", "ДОЛНА БАНЯ", "ДОЛНА МИТРОПОЛИЯ", "ДОЛНА ОРЯХОВИЦА",
	"ДОЛНИ ДЪБНИК", "ДОЛНИ ЧИФЛИК", "ДОСПАТ", "ДРАГОМАН", "ДРЯНОВО", "ДУЛОВО",
	"ДУНАВЦИ", "ДУПНИЦА", "ДЪЛГОПОЛ",
"ЕЛЕНА", "ЕЛИН ПЕЛИН", "ЕЛХОВО", "ЕТРОПОЛЕ",
"ЗАВЕТ", "ЗЕМЕН", "ЗЛАТАРИЦА", "ЗЛАТИЦА", "ЗЛАТОГРАД",
"ИВАЙЛОВГРАД", "ИГНАТИЕВО", "ИСКЪР", "ИСПЕРИХ", "ИХТИМАН",
"КАБЛЕШКОВО", "КАВАРНА", "КАЗАНЛЪК", "КАЛОФЕР", "КАМЕНО", "КАОЛИНОВО", "КАРЛОВО",
	"КАРНОБАТ", "КАСПИЧАН", "КЕРМЕН", "КИЛИФАРЕВО", "КИТЕН", "КЛИСУРА", "КНЕЖА",
	"КОЗЛОДУЙ", "КОЙНАРЕ", "КОПРИВЩИЦА", "КОСТАНДОВО", "КОСТЕНЕЦ", "КОСТИНБРОД",
	"КОТЕЛ", "КОЧЕРИНОВО", "КРЕСНА", "КРИВОДОЛ", "КРИЧИМ", "КРУМОВГРАД", "КРЪН",
	"КУБРАТ", "КУКЛЕН", "КУЛА", "КЪРДЖАЛИ", "КЮСТЕНДИЛ",
"ЛЕВСКИ", "ЛЕТНИЦА", "ЛОВЕЧ", "ЛОЗНИЦА", "ЛОМ", "ЛУКОВИТ", "ЛЪКИ", "ЛЮБИМЕЦ",
	"ЛЯСКОВЕЦ",
"МАДАН", "МАДЖАРОВО", "МАЛКО ТЪРНОВО", "МАРТЕН", "МЕЗДРА", "МЕЛНИК", "МЕРИЧЛЕРИ",
	"МИЗИЯ", "МОМИН ПРОХОД", "МОМЧИЛГРАД", "МОНТАНА", "МЪГЛИЖ",
"НЕДЕЛИНО", "НЕСЕБЪР", "НИКОЛАЕВО", "НИКОПОЛ", "НОВА ЗАГОРА", "НОВИ ИСКЪР", "НОВИ ПАЗАР",
"ОБЗОР", "ОМУРТАГ", "ОПАКА", "ОРЯХОВО",
"ПАВЕЛ БАНЯ", "ПАВЛИКЕНИ", "ПАЗАРДЖИК", "ПАНАГЮРИЩЕ", "ПЕРНИК", "ПЕРУЩИЦА", "ПЕТРИЧ",
	"ПЕЩЕРА", "ПИРДОП", "ПЛАЧКОВЦИ", "ПЛЕВЕН", "ПЛИСКА", "ПЛОВДИВ", "ПОЛСКИ ТРЪМБЕШ",
	"ПОМОРИЕ", "ПОПОВО", "ПОРДИМ", "ПРАВЕЦ", "ПРИМОРСКО", "ПРОВАДИЯ", "ПЪРВОМАЙ",
"РАДНЕВО", "РАДОМИР", "РАЗГРАД", "РАЗЛОГ", "РАКИТОВО", "РАКОВСКИ", "РИЛА", "РОМАН",
	"РУДОЗЕМ", "РУСЕ",
"САДОВО", "САМОКОВ", "САНДАНСКИ", "САПАРЕВА БАНЯ", "СВЕТИ ВЛАС", "СВИЛЕНГРАД",
	"СВИЩОВ", "СВОГЕ", "СЕВЛИЕВО", "СЕНОВО", "СЕПТЕМВРИ", "СИЛИСТРА", "СИМЕОНОВГРАД",
	"СИМИТЛИ", "СЛАВЯНОВО", "СЛИВЕН", "СЛИВНИЦА", "СЛИВО ПОЛЕ", "СМОЛЯН", "СМЯДОВО",
	"СОЗОПОЛ", "СОПОТ", "СОФИЯ", "СРЕДЕЦ", "СТАМБОЛИЙСКИ", "СТАРА ЗАГОРА", "СТРАЖИЦА",
	"СТРАЛДЖА", "СТРЕЛЧА", "СУВОРОВО", "СУНГУРЛАРЕ", "СУХИНДОЛ", "СЪЕДИНЕНИЕ", "СЪРНИЦА",
"ТВЪРДИЦА", "ТЕРВЕЛ", "ТЕТЕВЕН", "ТОПОЛОВГРАД", "ТРОЯН", "ТРЪН", "ТРЪСТЕНИК",
	"ТРЯВНА", "ТУТРАКАН", "ТЪРГОВИЩЕ",
"УГЪРЧИН",
"ХАДЖИДИМОВО", "ХАРМАНЛИ", "ХАСКОВО", "ХИСАРЯ",
"ЦАР КАЛОЯН", "ЦАРЕВО",
"ЧЕПЕЛАРЕ", "ЧЕРВЕН БРЯГ", "ЧЕРНОМОРЕЦ", "ЧИПРОВЦИ", "ЧИРПАН",
"ШАБЛА", "ШИВАЧЕВО", "ШИПКА", "ШУМЕН",
"ЯБЛАНИЦА", "ЯКОРУДА", "ЯМБОЛ"
};

const char *alphabet_u[NUM_ALPHABET] = {
	"А", "Б", "В", "Г", "Д", "Е", "Ж", "З", "И", "Й", "К", "Л", "М", "Н", "О", "П", "Р", "С", "Т", "У", "Ф", "Х", "Ц", "Ч", "Ш", "Щ", "Ъ", "Ь", "Ю", "Я"
};
const char *alphabet_l[NUM_ALPHABET] = {
	"а", "б", "в", "г", "д", "е", "ж", "з", "и", "й", "к", "л", "м", "н", "о", "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ь", "ю", "я"
};

size_t chrlen(char lb) {
		if (( lb & 0xF8 ) == 0xF0 ) return 4;      // 1111
		else if (( lb & 0xF0 ) == 0xE0 ) return 3; // 1110
		else if (( lb & 0xE0 ) == 0xC0 ) return 2; // 1100
		return 1;
}

size_t get_letter(char letter[5], const char *str) {
	size_t cl = chrlen(*str);
	strncpy(letter, str, cl);
	letter[cl] = '\0';
	return cl;
}

void mask(char *masked, const char *word, const char *mask) {
	const char *iword = word;
	strcpy(masked, "");
	while(*iword) {
		const char *imask = mask;
		char cletter[5], pletter[5] = "";
		size_t cl = get_letter(cletter, iword);
		iword += cl;

		if(! strcmp(cletter, " ")) {
			strcpy(pletter, " ");
		} else while(*imask) {
			char mletter[5];
			size_t ml = get_letter(mletter, imask);
			imask += ml;
			if( ! strcmp(cletter, mletter)) {
				strcpy(pletter, mletter);
			}
		}
		strcat(masked, *pletter ? pletter : "_");
	}
}

void read_input(char input[5]) {
	size_t il = 0;
	for(;;) {
		printf("Въведи буква: ");
		if(fgets(input, 4, stdin) == NULL) {
			strcpy(input, "");
			puts("Грешка при прочитане");
			return;
		}
		il = strlen(input);

		if(il-- && input[il] == '\n') {
			input[il] = '\0';
		}
		if( ! *input) return;
		for(int i = 0;i < NUM_ALPHABET; i++) {
			if( ! strcmp(input, alphabet_l[i])) {
				strcpy(input, alphabet_u[i]);
			}
			if( ! strcmp(input, alphabet_u[i])) return;
		}
		printf("Неприемлива буква \"%s\"!\n", input);
	}
}

int main() {
	setlocale(LC_ALL, "");
	srand((unsigned) time(NULL));
	const char *word = words[rand() % NUM_WORDS];
	size_t word_l = strlen(word);
	char guesses[NUM_ALPHABET] = ""
		, input[5]
		, masked[word_l]
		, last_m[word_l];
	int mistakes = 5, num_guesses = 0;
	*last_m = '\0';
	do {
		mask(masked, word, guesses);
		if( ! strcmp(masked, last_m)) {
			puts("Грешка!");
			if( ! mistakes--) {
				printf("Пробва цели %d пъти, но не можа да отгатнеш гр. %s\n", num_guesses, word);
				break;
			}
		}
		if( ! strcmp(masked, word)) {
			mistakes = 5 - mistakes;
			printf("Ти позна гр. %s с %d опита и %d %s.\n", word, num_guesses, mistakes, 1 == mistakes ? "грешка" : "грешки");
			break;
		}
		printf("\nПознай града (с до %d %s): %s\n", mistakes, 1 == mistakes ? "грешка" : "грешки", masked);

		read_input(input);
		if(*input && NULL != strstr(guesses, input)) {
			printf("Вече пробва с буквата \"%s\".\n", input);
			continue;
		}
		strcat(guesses, input);
		num_guesses++;
		strcpy(last_m, masked);
	} while(*input);
	puts("Довиждане!");
	return 0;
}
